---
title: FilterNumericValueRule
classe: Autodesk.Revit.DB.FilterNumericValueRule
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FilterValueRule
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# FilterNumericValueRule

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FilterNumericRuleEvaluator GetEvaluator()` | `filterNumericValueRule.GetEvaluator()` | FilterNumericRuleEvaluator |
| `Void SetEvaluator(FilterNumericRuleEvaluator)` | `filterNumericValueRule.SetEvaluator(evaluator)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```